{
    "posts": [
        {
            "id": 1,
            "title": "Rhiannon: Curse of the Four Branches",
            "body": "Rhiannon: Curse of the Four Branches is an adventure game by British developer Arberth Studios. It was originally published in English by Got Game Entertainment and Lighthouse Interactive. However, following the financial collapse of Lighthouse Interactive early in 2009, all European rights reverted to Arberth Studios. The developer then converted itself into a publisher and began selling the English game directly. In May 2009, Arberth dispensed with the services of Got Game Entertainment following months of declining stock availability in Got Game's North American Territory and a failure of Got Game to pay expected royalties. In August 2010, Arberth was still pursuing Got Game Entertainment for unpaid royalties. Arberth has since released a German version of the game. A Russian version appeared in 2009, translated and distributed by Logrus. In mid-2009, a group of French and Belgian enthusiasts known as Les Rhemystes completed the French translation and a download-only release followed in the Autumn, again published by Arberth Studios. Italian gaming site Puntaeclicca.com enabled the Italian download-only release in 2010. The game is set on the Celtic fringes of Britain; a place where myth and magic spill into reality, threatening the sanity of a teenage girl named Rhiannon. An ancient battle for revenge engulfs Ty Pryderi, the remote Welsh farmstead Rhiannon now calls home. She begins to hear unexplained noises, see disturbing visions, and experience other chilling paranormal phenomena. There is an ancient evil lurking in the walls of Ty Pryderi that holds a terrible connection to a timeless struggle between man and magic fabled in the Mabinogion Legends. Her parents take Rhiannon away, leaving Ty Pryderi to your watch and exploration, but their absence can only postpone the inevitability of revenge and death.",
            "tags": [
                "Adventure games",
                "Video games",
                "Windows games",
                "United Kingdom"
            ]
        },
        {
            "id": 2,
            "title": "Grand Theft Auto: Vice City",
            "body": "Grand Theft Auto: Vice City is a 2002 action-adventure game developed by Rockstar North and published by Rockstar Games. It is the fourth main entry in the Grand Theft Auto series, following 2001's Grand Theft Auto III. Set in 1986 within the fictional Vice City, based on Miami, the single-player story follows mobster Tommy Vercetti's rise to power after his release from prison and being caught up in an ambushed drug deal. While seeking out those responsible, he slowly builds an empire by seizing power from other criminal organisations in the city. The game is played from a third-person perspective and its world is navigated on foot or by vehicle. The open world design lets the player freely roam Vice City, consisting of two main islands. The game's plot is based on multiple real-world people and events in Miami such as Cubans, Haitians, and biker gangs, the 1980s crack epidemic, the Mafioso drug lords of Miami, and the dominance of glam metal. The game was also influenced by the film and television of the era, most notably Scarface and Miami Vice. Much of the development work constituted creating the game world to fit the inspiration and time period; the development team conducted extensive field research in Miami while creating the world. The game was released in October 2002 for the PlayStation 2, in May 2003 for Microsoft Windows, and in October 2003 for the Xbox. Upon release, Vice City received critical acclaim, with praise particularly directed at its music, gameplay and open world design. However, the game also generated controversy over its depiction of violence and racial groups, sparking lawsuits and protests. Vice City became the best-selling video game of 2002 and has sold over 17.5 million copies. Considered one of the most significant titles of the sixth generation of video games and one of the greatest video games ever made, it won numerous year-end accolades including Game of the Year awards from several gaming publications. Since its release, the game has received numerous ports to many gaming platforms. An enhanced version was released for mobile platforms in 2012 for the game's tenth anniversary. Its successor, Grand Theft Auto: San Andreas, was released in 2004, and a prequel, Vice City Stories, was released in 2006.",
            "tags": [
                "Action-adventure games",
                "Rockstar Games",
                "Open-world video games",
                "Windows games"
            ]
        },
        {
            "id": 3,
            "title": "Grand Theft Auto IV",
            "body": "Grand Theft Auto IV is a 2008 action-adventure game developed by Rockstar North and published by Rockstar Games. It is the first main entry in the Grand Theft Auto series since 2004's Grand Theft Auto: San Andreas. Set within the fictional Liberty City, based on New York City, the single-player story follows Eastern European war veteran Niko Bellic and his attempts to escape his past while under pressure from loan sharks and mob bosses. The open world design lets players freely roam Liberty City, consisting of three main islands. The game is played from a third-person perspective and its world is navigated on-foot or by vehicle. Throughout the single-player mode, players control Niko Bellic. An online multiplayer mode is also included with the game, allowing up to 32 players to engage in both co-operative and competitive gameplay in a recreation of the single-player setting.[b] Two expansion packs were later released for the game, The Lost and Damned and The Ballad of Gay Tony, which both feature new plots that are interconnected with the main Grand Theft Auto IV storyline, and follow new protagonists. Development of Grand Theft Auto IV began soon after the release of San Andreas and was shared between many of Rockstar's studios worldwide. The game introduced a shift to a more realistic and detailed style and tone for the series. Unlike previous entries, Grand Theft Auto IV lacked a strong cinematic influence, as the team attempted an original approach to the story. As part of their research for the open world, the development team conducted extensive field research in New York, capturing over 100,000 photographs and several hours of video. The developers considered the world to be the most important elements of the game; though not the largest map in the series, they considered it comparable in scope due to its verticality and level of detail. It was released for the PlayStation 3 and Xbox 360 consoles in April 2008, and for Microsoft Windows in December. Upon release, the game received critical acclaim, with praise particularly directed at the narrative and open world design. Grand Theft Auto IV broke industry sales records and became the fastest-selling entertainment product in history at the time, earning US$310 million in its first day and US$500 million in its first week. Considered one of the most significant titles of the seventh generation of video games, and by many critics as one of the greatest video games of all time, it won year-end accolades, including Game of the Year awards from several gaming publications. It is among the best-selling video games with over 25 million copies sold by 2013. The game also generated controversy, with criticism directed at the game's depiction of violence and players' ability to drive under the influence of alcohol. Its successor, Grand Theft Auto V, was released in September 2013.",
            "tags": [
                "Action-adventure games",
                "Rockstar Games",
                "Open-world video games",
                "Windows games",
                "2008 video games"
            ]
        }
    ]
}